{"id":30,"metadata":{"title":"Meshroom","description":"Open source photogrammetry software by AliceVision","tags":["software","photogrammetry"],"wip":true},"slug":"software/Meshroom","text":"Meshroom Meshroom is an open-source photogrammetry tool built on the AliceVision framework .It uses a node based workflow to control the reconstruction parameters. Specific Overview The Meshroom software is a split into distinct parts: The user interface and the AliceVision backend.The user interface contains the images pane, the 3D viewer and the graph editor, which can be used to define a processing pipeline. The configured pipeline can either be executed directly from the user interface, or be saved and executed using the headless command line version of Meshroom, for example on a server. Software License / Pricing Meshroom is available for free under the Mozilla Public License Version 2.0 Software Features Software Requirements Meshroom needs a CUDA-enabled GPU (Nvidia). The MeshroomCL fork can be run on a variety of GPU platforms that support OpenCL. Resources History See Also Meshroom Github References (Video) Full Photogrammetry Workflow using Meshroom https://github.com/alicevision/meshroom/blob/develop/LICENSE-MPL2.md ","html":"\n<h1>Meshroom</h1>\n<p><a href=\"https://alicevision.org/#meshroom\"><strong>Meshroom</strong></a> is an open-source photogrammetry tool built on the <a href=\"https://github.com/alicevision/AliceVision\">AliceVision framework</a>.\nIt uses a node based workflow to control the reconstruction parameters.</p>\n<h2>Specific Overview</h2>\n<p>The Meshroom software is a split into distinct parts: The user interface and the AliceVision backend.\nThe user interface contains the images pane, the 3D viewer and the graph editor, which can be used to define a processing pipeline. The configured pipeline can either be executed directly from the user interface, or be saved and executed using the headless command line version of Meshroom, for example on a server.</p>\n<h2>Software License / Pricing</h2>\n<p>Meshroom is available for free under the Mozilla Public License Version 2.0 <sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup></p>\n<h2>Software Features</h2>\n<p></p>\n<h2>Software Requirements</h2>\n<p>Meshroom needs a CUDA-enabled GPU (Nvidia). The <a href=\"https://github.com/openphotogrammetry/meshroomcl\">MeshroomCL</a> fork can be run on a variety of GPU platforms that support OpenCL.</p>\n<h2>Resources</h2>\n<p></p>\n<h2>History</h2>\n<p></p>\n<h2>See Also</h2>\n<p></p>\n<ul>\n<li><a href=\"https://github.com/alicevision/meshroom\">Meshroom Github</a></li>\n</ul>\n<h2>References</h2>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=k4NTf0hMjtY\">(Video) Full Photogrammetry Workflow using Meshroom</a></li>\n</ul>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p><a href=\"https://github.com/alicevision/meshroom/blob/develop/LICENSE-MPL2.md\">https://github.com/alicevision/meshroom/blob/develop/LICENSE-MPL2.md</a> <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n"}