{"id":24,"metadata":{"title":"Software Template","description":"Template for pages about software solutions","tags":["meta","template","software"],"wip":true},"slug":"meta/templates/template_software","text":"Software Name About Software Please enter a brief description of the Software that describes what the it is, where/who it came from and how it is used in the industry of 3D scanningPlease note that you do not need to fill out all of these fields, only the ones that apply to the software. Specific Overview Give an overview of the software, Are there multiple versions? can you use it for free? what is the expected industry for this software? Child Information For topics which need to break down even further, IE specific details about how it writes out obj files.If this information block gets too busy its best split into its own page. Software License / Pricing Give an overview of the licensing scheme and associated price of the software, or link to the pricing page of thevendor. Software Features Give an overview of the featuresThis could include any API it has Feel free to use tables here to give explicit looks at the features between software versions Software Requirements Give an overview of the requirements to run this software Hardware Related to the software Please list hardware here that may be required by the software For topics such as photogrammetry which have incredibly broad hardware options please link to a sub-page, ie \"Software_Hardware\" For topics with a strong DIY community or DIY options, then please link to a DIY page Resources Please link to any strong videos on the software , if this gets too broad then please link to a sub page, ie \"BestPhotogrammetrySoftware_Resources\" History Give an overview of the history of the software See Also Is the software similar to another, but not linked directly in this page?Please link to any other topics that may be similar that people would want to read more on References Any references made in this can be cited here and linked.We do not mind links to blogs or youtube videos, as a lot of topics in this field are uncovered by trial and error, so we can expect a lot of community sourced information to come in this form. ","html":"\n<h1>Software Name</h1>\n<p>About Software</p>\n<p>Please enter a brief description of the Software that describes what the it is, where/who it came from and how it is used in the industry of 3D scanning\nPlease note that you do not need to fill out all of these fields, only the ones that apply to the software.</p>\n<h2>Specific Overview</h2>\n<p>Give an overview of the software, Are there multiple versions? can you use it for free? what is the expected industry for this software?</p>\n<h3>Child Information</h3>\n<p>For topics which need to break down even further, IE specific details about how it writes out obj files.\nIf this information block gets too busy its best split into its own page.</p>\n<h2>Software License / Pricing</h2>\n<p>Give an overview of the licensing scheme and associated price of the software, or link to the pricing page of the\nvendor.</p>\n<h2>Software Features</h2>\n<p>Give an overview of the features\nThis could include any API it has</p>\n<p>Feel free to use tables here to give explicit looks at the features between software versions</p>\n<h2>Software Requirements</h2>\n<p>Give an overview of the requirements to run this software</p>\n<h2>Hardware Related to the software</h2>\n<p>Please list hardware here that may be required by the software</p>\n<p>For topics such as photogrammetry which have incredibly broad hardware options please link to a sub-page, ie &quot;Software_Hardware&quot;</p>\n<p>For topics with a strong DIY community or DIY options, then please link to a DIY page</p>\n<h2>Resources</h2>\n<p>Please link to any strong videos on the software , if this gets too broad then please link to a sub page, ie &quot;BestPhotogrammetrySoftware_Resources&quot;</p>\n<h2>History</h2>\n<p>Give an overview of the history of the software</p>\n<h2>See Also</h2>\n<p>Is the software similar to another, but not linked directly in this page?\nPlease link to any other topics that may be similar that people would want to read more on</p>\n<h2>References</h2>\n<p>Any references made in this can be cited here and linked.\nWe do not mind links to blogs or youtube videos, as a lot of topics in this field are uncovered by trial and error, so we can expect a lot of community sourced information to come in this form.</p>\n"}