{"id":22,"metadata":{"title":"Overview Template","description":"Template for the overview category of pages","tags":["meta","template","overview"],"wip":true},"slug":"meta/templates/template_overview","text":"Subject Name About Subject Please enter a brief description of the subject that describes what the subject is, where/who it came from and how it is used in the industry of 3D scanning Specific Overview Give an overview of the subject that the readers would want to read about.We are using ‘Heading 2’ for these main level information blocks This could be, in the case of Photogrammetry, a ‘Common Process’ where you can break down the Common elements of Feature detection, SFM, MVS and more into subsequent child information sections. Please make as many of these main level information blocks as needed to cover a subject. Child Information For topics which need to break down even further, IE specific details about feature detection.If this information block gets too busy its best split into its own page. Software Please list any software here.There can be comparison charts for features however there must be zero bias in thisAny and all bias will be removed. Hardware Please list hardware hereFor topics such as photogrammetry which have incredibly broad hardware options please link to a sub-page, ie \"Photogrammetry_Hardware\" For topics with a strong DIY community or DIY options, then please link to a DIY page Resources Please link to any strong (generally unbiased) videos on the topic, if this gets too broad then please link to a sub page, ie \"Photogrammetry_Resources\" See Also Is the subject similar to another, but not linked directly in this page?Please link to any other topics that may be similar that people would want to read more on References Any references made in this can be cited here and linked.We do not mind links to blogs or youtube videos, as a lot of topics in this field are uncovered by trial and error, so we can expect a lot of community sourced information to come in this form. ","html":"\n<h1>Subject Name</h1>\n<p>About Subject</p>\n<p>Please enter a brief description of the subject that describes what the subject is, where/who it came from and how it is used in the industry of 3D scanning</p>\n<h2>Specific Overview</h2>\n<p>Give an overview of the subject that the readers would want to read about.\nWe are using ‘Heading 2’ for these main level information blocks</p>\n<p>This could be, in the case of Photogrammetry, a ‘Common Process’ where you can break down the Common elements of Feature detection, SFM, MVS and more into subsequent child information sections.</p>\n<p>Please make as many of these main level information blocks as needed to cover a subject.</p>\n<h3>Child Information</h3>\n<p>For topics which need to break down even further, IE specific details about feature detection.\nIf this information block gets too busy its best split into its own page.</p>\n<h2>Software</h2>\n<p>Please list any software here.\nThere can be comparison charts for features however there must be zero bias in this\nAny and all bias will be removed.</p>\n<h2>Hardware</h2>\n<p>Please list hardware here\nFor topics such as photogrammetry which have incredibly broad hardware options please link to a sub-page, ie &quot;Photogrammetry_Hardware&quot;</p>\n<p>For topics with a strong DIY community or DIY options, then please link to a DIY page</p>\n<h2>Resources</h2>\n<p>Please link to any strong (generally unbiased) videos on the topic, if this gets too broad then please link to a sub page, ie &quot;Photogrammetry_Resources&quot;</p>\n<h2>See Also</h2>\n<p>Is the subject similar to another, but not linked directly in this page?\nPlease link to any other topics that may be similar that people would want to read more on</p>\n<h2>References</h2>\n<p>Any references made in this can be cited here and linked.\nWe do not mind links to blogs or youtube videos, as a lot of topics in this field are uncovered by trial and error, so we can expect a lot of community sourced information to come in this form.</p>\n"}