{"id":6,"metadata":{"title":"Coded Marker","description":null,"tags":["concept"]},"slug":"concept/Coded_Marker","text":"Coded Marker Coded markers are a usually unique black and white marker which get picked up by software. They are placed in the scene before scanning an object, and are automatically detected when processing the images. Due to the uniqueness of each marker, the software can distinguish them. They can act as a scale reference when the distance between at least 2 markers is known, or just help with aligning the pictures due to their high contrast.Multiple types of coded markers exist, and many software packages have support for multiple. Types of markers: a) Circular, b) April Tags, c) non-coded markers a) Circular Markers b) April Tags c) Non coded markers Circular Markers Circular markers usually consist of an inner circle with a small white dot, and of the coded outer circle. The center white dot has the advantage that in case the software does not pick the marker up automatically, a human can easily mark the center of the tag manually. Software Compatible 3DF Zephyr No Agisoft Metashape Yes (pro only) Apple Object Capture No [?] Reality Capture Yes April Tags April tags were first introduced by Edwin Olson in 2011 as a robust and flexible fiducial system for usage in autonomous robots . They are designed similar to QR-codes to be recognized by software, which makes them optimal for use in photogrammetry as well. Most photogrammetry software that supports coded markers supports some of the versions of april tags as well. Like QR-codes, april tags consist of a grid of black and white cells, composing a tow-dimensional bar code. However, they are designed for a much smaller data size between 4 to 12 bits. This allows them to be detectable and decodable under much worse circumstances. Software Compatible 3DF Zephyr Yes Agisoft Metashape Yes (pro only) Apple Object Capture No [?] Reality Capture Yes April Tag Variants There are multiple generations of april tags, with the newest being AprilTag 3 (in review) and the most used being AprilTag 2. AprilTags come in multiple payload capacity and error correction versions. They are usually denoted with a name in the following format: 36h11, where 36 refers to a 36 bit encoding, and the 11 refers to a minimum Hamming distance of 11 bits between any valid tags. In short, increasing the first number leads to bigger tags and more possible unique tags. Increasing the second number decreases the number of false positives that are picked up by the software, but also reduces the amount of possible unique tags. AprilTags are designed to work with low resolution images, where the likelihood of noise resembling a valid tag is extremely small. For high resolution images as is commonly used in photogrammetry, it is recommended to use a tag with a high Hamming distance, such as the previously named 36h11. Non-coded markers Markers that do not include any kind of code usually provide a hight contrast features for photogrammetry software to recognize. In addition they make it easier for humans to manually find the same points in multiple pictures for manual control points. https://www.3dflow.net/zephyr-doc/en/PrintMarkersandmarkersuse.html https://www.agisoft.com/pdf/metashape-pro_1_8_en.pdf https://support.capturingreality.com/hc/en-us/articles/360003869672-How-to-use-Detect-Markers-Tool Olson, E. (2011). AprilTag: A robust and flexible visual fiducial system . Proceedings of the IEEE International Conference on Robotics and Automation (ICRA), 3400–3407. https://www.3dflow.net/technology/documents/3df-zephyr-tutorials/coded-targets-automatic-detection/ Wang, J., & Olson, E. (2016, October). AprilTag 2: Efficient and robust fiducial detection . Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). https://en.wikipedia.org/wiki/Hamming_distance ","html":"\n<h1>Coded Marker</h1>\n<p>Coded markers are a usually unique black and white marker which get picked up by software. They are placed in the scene before scanning an object, and are automatically detected when processing the images. Due to the uniqueness of each marker, the software can distinguish them. They can act as a scale reference when the distance between at least 2 markers is known, or just help with aligning the pictures due to their high contrast.\nMultiple types of coded markers exist, and many software packages have support for multiple.</p>\n<p><img src=\"https://i.imgur.com/DPsH7wH.png\" alt=\"Types of markers: a) Circular, b) April Tags, c) non-coded markers\"></p>\n<ul>\n<li>a) Circular Markers</li>\n<li>b) April Tags</li>\n<li>c) Non coded markers</li>\n</ul>\n<h2>Circular Markers</h2>\n<p>Circular markers usually consist of an inner circle with a small white dot, and of the coded outer circle. The center white dot has the advantage that in case the software does not pick the marker up automatically, a human can easily mark the center of the tag manually.</p>\n<table>\n<thead>\n<tr>\n<th>Software</th>\n<th>Compatible</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>3DF Zephyr</td>\n<td>No <sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup></td>\n</tr>\n<tr>\n<td>Agisoft Metashape</td>\n<td>Yes (pro only) <sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup></td>\n</tr>\n<tr>\n<td>Apple Object Capture</td>\n<td>No [?]</td>\n</tr>\n<tr>\n<td>Reality Capture</td>\n<td>Yes <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup></td>\n</tr>\n</tbody>\n</table>\n<h2>April Tags</h2>\n<p>April tags were first introduced by Edwin Olson in 2011 as a robust and flexible fiducial system for usage in autonomous robots <sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup>. They are designed similar to <a href=\"https://de.wikipedia.org/wiki/QR-Code\">QR-codes</a> to be recognized by software, which makes them optimal for use in photogrammetry as well. Most photogrammetry software that supports coded markers supports some of the versions of april tags as well.</p>\n<p>Like QR-codes, april tags consist of a grid of black and white cells, composing a tow-dimensional bar code. However, they are designed for a much smaller data size between 4 to 12 bits. This allows them to be detectable and decodable under much worse circumstances.</p>\n<table>\n<thead>\n<tr>\n<th>Software</th>\n<th>Compatible</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>3DF Zephyr</td>\n<td>Yes <sup class=\"footnote-ref\"><a href=\"#fn5\" id=\"fnref5\">[5]</a></sup></td>\n</tr>\n<tr>\n<td>Agisoft Metashape</td>\n<td>Yes (pro only) <sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2:1\">[2:1]</a></sup></td>\n</tr>\n<tr>\n<td>Apple Object Capture</td>\n<td>No [?]</td>\n</tr>\n<tr>\n<td>Reality Capture</td>\n<td>Yes <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3:1\">[3:1]</a></sup></td>\n</tr>\n</tbody>\n</table>\n<h3>April Tag Variants</h3>\n<p>There are multiple generations of april tags, with the newest being AprilTag 3 (in review) and the most used being AprilTag 2<sup class=\"footnote-ref\"><a href=\"#fn6\" id=\"fnref6\">[6]</a></sup>. AprilTags come in multiple payload capacity and error correction versions. They are usually denoted with a name in the following format: <code>36h11</code>, where 36 refers to a 36 bit encoding, and the 11 refers to a minimum Hamming distance <sup class=\"footnote-ref\"><a href=\"#fn7\" id=\"fnref7\">[7]</a></sup> of 11 bits between any valid tags. In short, increasing the first number leads to bigger tags and more possible unique tags. Increasing the second number decreases the number of false positives that are picked up by the software, but also reduces the amount of possible unique tags. AprilTags are designed to work with low resolution images, where the likelihood of noise resembling a valid tag is extremely small. For high resolution images as is commonly used in photogrammetry, it is recommended to use a tag with a high Hamming distance, such as the previously named <code>36h11</code>.</p>\n<h2>Non-coded markers</h2>\n<p>Markers that do not include any kind of code usually provide a hight contrast features for photogrammetry software to recognize. In addition they make it easier for humans to manually find the same points in multiple pictures for manual control points.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p><a href=\"https://www.3dflow.net/zephyr-doc/en/PrintMarkersandmarkersuse.html\">https://www.3dflow.net/zephyr-doc/en/PrintMarkersandmarkersuse.html</a> <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p><a href=\"https://www.agisoft.com/pdf/metashape-pro_1_8_en.pdf\">https://www.agisoft.com/pdf/metashape-pro_1_8_en.pdf</a> <a href=\"#fnref2\" class=\"footnote-backref\">↩︎</a> <a href=\"#fnref2:1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p><a href=\"https://support.capturingreality.com/hc/en-us/articles/360003869672-How-to-use-Detect-Markers-Tool\">https://support.capturingreality.com/hc/en-us/articles/360003869672-How-to-use-Detect-Markers-Tool</a> <a href=\"#fnref3\" class=\"footnote-backref\">↩︎</a> <a href=\"#fnref3:1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p>Olson, E. (2011). <em>AprilTag: A robust and flexible visual fiducial system</em>. Proceedings of the IEEE International Conference on Robotics and Automation (ICRA), 3400–3407. <a href=\"#fnref4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn5\" class=\"footnote-item\"><p><a href=\"https://www.3dflow.net/technology/documents/3df-zephyr-tutorials/coded-targets-automatic-detection/\">https://www.3dflow.net/technology/documents/3df-zephyr-tutorials/coded-targets-automatic-detection/</a> <a href=\"#fnref5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn6\" class=\"footnote-item\"><p>Wang, J., &amp; Olson, E. (2016, October). <em>AprilTag 2: Efficient and robust fiducial detection</em>. Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). <a href=\"#fnref6\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn7\" class=\"footnote-item\"><p><a href=\"https://en.wikipedia.org/wiki/Hamming_distance\">https://en.wikipedia.org/wiki/Hamming_distance</a> <a href=\"#fnref7\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n"}