{"id":20,"metadata":{"title":"3D Scanning wiki template","description":null,"tags":["meta","template"]},"slug":"meta/template","text":"3D Scanning Wiki templates About templates To successfully maintain a wiki with such a large potential for the information we need a solid template libraryas we are breaking down each page type into its own category, we need to ensure that the information provided is consistent and easy to read. As we progress, these templates will be updated with nicer CSS. For now the templates are simple, with the goal of allowing for mass data entry. Overview Templates An overview template is to be used for a top level topic that would spawn off a lot of smaller child pagesFor Example, Structured Light Scanning would be a top level topic, and use an overview page.These pages contain broad information about the topic without going into meticulous detail, allowing the reader to quickly understand and read further if needed. The template for Software pages can be found here: template_overview . Software Templates The template for software is very broad, this is due to the wide variety of software used in the 3D scanning industry. When using it, please fill out all fields that are applicable in the tables included, we encourage clear information regarding system requirements, hardware requirements and anything else that may help Since software is such a broad topic, we also request that the sub pages listed in Resource_Templates are used, as things such as API documentation, tutorials and other useful insights are essential for anyone who uses that software. The template for Software pages can be found here: template_software . Hardware Templates The template for Hardware pages can be found here: template_hardware . Workflow Templates Workflow templates are to be used for anything that is to be considered a ‘Guide’ or a list of processes For instance, workflows could be things such as an order of operations for baking textures, fixing lidar station misalignment or even how to get optimal polarizer orientation The template for Workflows can be found here: template_workflow . Comparison Templates Comparisons are to be used with caution, as while they are useful, they can also be very heavily biased. with this in mind we will only setup comparison pages if the data to compare allows the user to come to a conclusion based on what they read.Comparisons should never encourage one software over another. with this in mind, we explicitly request that no-one makes comparison pages without prior approval. Resource Templates Resources are sub-pages of any topic that may have lots of external information pertaining to everything from use cases, API reference, techniques or even blogsThese pages will be curated to ensure that there is no misinformation or advice that may lead people down incorrect paths. All resource pages must follow this naming convention: [parentPageName]_resources the template for resources can be found here template_resources . ","html":"\n<h1>3D Scanning Wiki templates</h1>\n<h2>About templates</h2>\n<p>To successfully maintain a wiki with such a large potential for the information we need a solid template library\nas we are breaking down each page type into its own category, we need to ensure that the information provided is consistent and easy to read.</p>\n<p>As we progress, these templates will be updated with nicer CSS.</p>\n<p>For now the templates are simple, with the goal of allowing for mass data entry.</p>\n<h2>Overview Templates</h2>\n<p>An overview template is to be used for a top level topic that would spawn off a lot of smaller child pages\nFor Example, Structured Light Scanning would be a top level topic, and use an overview page.\nThese pages contain broad information about the topic without going into meticulous detail, allowing the reader to quickly understand and read further if needed.</p>\n<p>The template for Software pages can be found here: <a href=\"templates/template_overview\">template_overview</a>.</p>\n<h2>Software Templates</h2>\n<p>The template for software is very broad, this is due to the wide variety of software used in the 3D scanning industry.</p>\n<p>When using it, please fill out all fields that are applicable in the tables included, we encourage clear information regarding system requirements, hardware requirements and anything else that may help</p>\n<p>Since software is such a broad topic, we also request that the sub pages listed in Resource_Templates are used, as things such as API documentation, tutorials and other useful insights are essential for anyone who uses that software.</p>\n<p>The template for Software pages can be found here: <a href=\"templates/template_software\">template_software</a>.</p>\n<h2>Hardware Templates</h2>\n<p>The template for Hardware pages can be found here: <a href=\"templates/template_hardware\">template_hardware</a>.</p>\n<h2>Workflow Templates</h2>\n<p>Workflow templates are to be used for anything that is to be considered a ‘Guide’ or a list of processes</p>\n<p>For instance, workflows could be things such as an order of operations for baking textures, fixing lidar station misalignment or even how to get optimal polarizer orientation</p>\n<p>The template for Workflows can be found here: <a href=\"templates/template_workflow\">template_workflow</a>.</p>\n<h2>Comparison Templates</h2>\n<p>Comparisons are to be used with caution, as while they are useful, they can also be very heavily biased. with this in mind we will only setup comparison pages if the data to compare allows the user to come to a conclusion based on what they read.\nComparisons should never encourage one software over another.</p>\n<p>with this in mind, we explicitly request that no-one makes comparison pages without prior approval.</p>\n<h2>Resource Templates</h2>\n<p>Resources are sub-pages of any topic that may have lots of external information pertaining to everything from use cases, API reference, techniques or even blogs\nThese pages will be curated to ensure that there is no misinformation or advice that may lead people down incorrect paths.</p>\n<p>All resource pages must follow this naming convention: [parentPageName]_resources</p>\n<p>the template for resources can be found here <a href=\"templates/template_resources\">template_resources</a>.</p>\n"}