{"id":1,"metadata":{"title":"Photogrammetry","description":"Using Photographs to measure and extract information about a subject","tags":["overview","photogrammetry"],"wip":true},"slug":"Photogrammetry","text":"Photogrammetry Photogrammetry is the science and technology of obtaining reliable information about physical objects and the environment through the process of recording, measuring and interpreting photographic images and patterns. Understanding how and why Photogrammetry is used, and where to use it is critical within the industry of digital acquisition. There are many variants of Photogrammetry, however this topic will limited to the the process of extracting useful data from images, with the end goal of producing 3 Dimensional measurements either for the further use in real time rendering, manufacturing, inspection and survey. Methods Typical photogrammetry is seen as the process of taking many images of a surface or object. These images are fed into a photogrammetry software which processes them to extract info about the photographed objects. Applications Software See the Photogrammetry section on the Software page. Hardware Photogrammetry hardware is a broad topic, however here it is broken down into two sub-categories, Acquisition and Processing Data Acquisition As a rule of thumb, best tool for capturing images is the camera you have on you at the time, however when it comes to acquiring the best data there are several key factors to consider: Lighting Depth of field Shutter speed ISO Sharpness Lighting In general it is preferred to have even diffuse lighting from all sides, and no visible shadows or highlights on the object itself. Moving shadows can be interpreted by the photogrammetry software as a feature point, which can negatively impact the resulting geometry. Fixed shadows will most likely not impact geometry too much, but it will be visible in the texture as baked in lighting, which will look bad if the object is rendered in a scene where the lighting does not match the condition where the object was scanned. The easiest way to achieve a very diffuse light is to wait for a overcast day and scan the object outdoors. Other options include big soft-boxes and photography tents. Most professional 3d scanners use a ring flash light around the camera lense. This way the visible part of the object is fully illuminated, and no shadows are ever visible to the camera. Depth of field Photogrammetry software searches for feature points in the images, which it can match with the same point in as many images as possible. These feature points need to have a high contrast and be as sharp as possible. Therefore the images need to have as much in focus as possible. It is generally recommended to use an aperture with f8 to f11 . Shutter speed When scanning an object handheld, it is important to use a fast shutter speed, as motion blur will make finding the feature points more difficult or even impossible. In general it is recommended to keep the shutter speed as high as possible, although when using a tripod with an external shutter release the shutter speed can be decreased to allow for a lower ISO or smaller aperture. ISO The ISO setting of a digital camera determines how sensitive the camera sensor is to light. A higher ISO setting results in a brighter image. As a side effect, a high sensitivity also means the sensor will pick up more noise. To get the best results, it is preferable to keep the ISO as low (close to ISO 100) as possible. Depending on the sensor higher values are tolerable. Sharpness For the same reasons as mentioned in the depth of field section, it is preferable to capture as sharp images as possible. Generally the sharpness depends on the camera lense. For most lenses there exists some documentation on their sharpness and what lense settings (zoom, aperture) result in the sharpest image. Processing Resources Julia Haines. \"Photogrammetry Workflow using a DSLR Camera\". Published September 24, 2019.Full photogrammetry workflow using Agisoft Metashape Vlad Kuzmin. \"Full Photogrammetry Guide for 3D Artists\". Published March 05, 2018.In debth photogrammetry guide using Reality Capture Grzegorz Baran. \"Photogrammetry Setup for Indoor 3D Prop Scanning\". Published June 10, 2021.Detailed workflow for turntable based prop scanning, including important theoretical knowledge. See Also Is the subject similar to another, but not linked directly in this page?Please link to any other topics that may be similar that people would want to read more on References Any references made in this can be cited here and linked.We do not mind links to blogs or youtube videos, as a lot of topics in this field are uncovered by trial and error, so we can expect a lot of community sourced information to come in this form. https://scholarslab.lib.virginia.edu/blog/documentation-photogrammetry/ https://scholarslab.lib.virginia.edu/blog/documentation-photogrammetry/ https://80.lv/articles/full-photogrammetry-guide-for-3d-artists/ https://www.youtube.com/watch?v=REA3XNgUMJg ","html":"\n<h1>Photogrammetry</h1>\n<p><strong>Photogrammetry</strong> is the science and technology of obtaining reliable information about physical objects and the environment through the process of recording, measuring and interpreting photographic images and patterns.</p>\n<p>Understanding how and why Photogrammetry is used, and where to use it is critical within the industry of digital acquisition.</p>\n<p>There are many variants of Photogrammetry, however this topic will limited to the the process of extracting useful data from images, with the end goal of producing 3 Dimensional measurements either for the further use in real time rendering, manufacturing, inspection and survey.</p>\n<h2>Methods</h2>\n<p>Typical photogrammetry is seen as the process of taking many images of a surface or object. These images are fed into a photogrammetry software which processes them to extract info about the photographed objects.</p>\n<p></p>\n<p></p>\n<h2>Applications</h2>\n<h2>Software</h2>\n<p>See the Photogrammetry section on the <a href=\"Software\">Software</a> page.</p>\n<h2>Hardware</h2>\n<p>Photogrammetry hardware is a broad topic, however here it is broken down into two sub-categories, Acquisition and Processing</p>\n<h3>Data Acquisition</h3>\n<p>As a rule of thumb, best tool for capturing images is the camera you have on you at the time, however when it comes to acquiring the best data there are several key factors to consider:</p>\n<ul>\n<li>Lighting</li>\n<li>Depth of field</li>\n<li>Shutter speed</li>\n<li>ISO</li>\n<li>Sharpness</li>\n</ul>\n<h4>Lighting</h4>\n<p>In general it is preferred to have even diffuse lighting from all sides, and no visible shadows or highlights on the object itself. Moving shadows can be interpreted by the photogrammetry software as a feature point, which can negatively impact the resulting geometry. Fixed shadows will most likely not impact geometry too much, but it will be visible in the texture as baked in lighting, which will look bad if the object is rendered in a scene where the lighting does not match the condition where the object was scanned.</p>\n<p>The easiest way to achieve a very diffuse light is to wait for a overcast day and scan the object outdoors.</p>\n<p>Other options include big soft-boxes and photography tents.</p>\n<p>Most professional 3d scanners use a ring flash light around the camera lense. This way the visible part of the object is fully illuminated, and no shadows are ever visible to the camera.</p>\n<h4>Depth of field</h4>\n<p>Photogrammetry software searches for feature points in the images, which it can match with the same point in as many images as possible. These feature points need to have a high contrast and be as sharp as possible. Therefore the images need to have as much in focus as possible. It is generally recommended to use an aperture with f8 to f11 <sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup>.</p>\n<h4>Shutter speed</h4>\n<p>When scanning an object handheld, it is important to use a fast shutter speed, as motion blur will make finding the feature points more difficult or even impossible. In general it is recommended to keep the shutter speed as high as possible, although when using a tripod with an external shutter release the shutter speed can be decreased to allow for a lower ISO or smaller aperture.</p>\n<h4>ISO</h4>\n<p>The ISO setting of a digital camera determines how sensitive the camera sensor is to light. A higher ISO setting results in a brighter image. As a side effect, a high sensitivity also means the sensor will pick up more noise. To get the best results, it is preferable to keep the ISO as low (close to ISO 100) as possible. Depending on the sensor higher values are tolerable.</p>\n<h4>Sharpness</h4>\n<p>For the same reasons as mentioned in the depth of field section, it is preferable to capture as sharp images as possible. Generally the sharpness depends on the camera lense. For most lenses there exists some documentation on their sharpness and what lense settings (zoom, aperture) result in the sharpest image.</p>\n<h3>Processing</h3>\n<h2>Resources</h2>\n<p></p>\n<ul>\n<li>Julia Haines. &quot;Photogrammetry Workflow using a DSLR Camera&quot;. Published September 24, 2019.\nFull photogrammetry workflow using <a href=\"software/Agisoft_Metashape\">Agisoft Metashape</a> <sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup></li>\n<li>Vlad Kuzmin. &quot;Full Photogrammetry Guide for 3D Artists&quot;. Published March 05, 2018.\nIn debth photogrammetry guide using <a href=\"software/Reality_Capture\">Reality Capture</a> <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup></li>\n<li>Grzegorz Baran. &quot;Photogrammetry Setup for Indoor 3D Prop Scanning&quot;. Published June 10, 2021.\nDetailed workflow for turntable based prop scanning, including important theoretical knowledge. <sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup></li>\n</ul>\n<h2>See Also</h2>\n<p>Is the subject similar to another, but not linked directly in this page?\nPlease link to any other topics that may be similar that people would want to read more on</p>\n<h2>References</h2>\n<p>Any references made in this can be cited here and linked.\nWe do not mind links to blogs or youtube videos, as a lot of topics in this field are uncovered by trial and error, so we can expect a lot of community sourced information to come in this form.</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p><a href=\"https://scholarslab.lib.virginia.edu/blog/documentation-photogrammetry/\">https://scholarslab.lib.virginia.edu/blog/documentation-photogrammetry/</a> <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p><a href=\"https://scholarslab.lib.virginia.edu/blog/documentation-photogrammetry/\">https://scholarslab.lib.virginia.edu/blog/documentation-photogrammetry/</a> <a href=\"#fnref2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p><a href=\"https://80.lv/articles/full-photogrammetry-guide-for-3d-artists/\">https://80.lv/articles/full-photogrammetry-guide-for-3d-artists/</a> <a href=\"#fnref3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p><a href=\"https://www.youtube.com/watch?v=REA3XNgUMJg\">https://www.youtube.com/watch?v=REA3XNgUMJg</a> <a href=\"#fnref4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n"}