{"id":2,"metadata":{"title":"Photometric Stereo","description":"Estimating surface normals from lighting changes","tags":["overview","photometric stereo","surface capture"],"wip":true},"slug":"Photometric_Stereo","text":"Photometric Stereo Example image - photometric stereo Photometric stereo is a technique in computer vision for estimating the surface normals of objects by observing that object under different lighting conditions. It is based on the fact that the amount of light reflected by a surface is dependent on the orientation of the surface in relation to the light source and the observer. By measuring the amount of light reflected into a camera, the space of possible surface orientations is limited. Given enough light sources from different angles, the surface orientation may be constrained to a single orientation or even over-constrained. Methods Applications Software See the photometric stereo section on the Software page. Hardware Data Acquisition Resources Calibration Based Photometric Stereo | Photometric Stereo See Also References ","html":"\n<h1>Photometric Stereo</h1>\n<p><img src=\"photometric_stereo.png\" alt=\"Example image - photometric stereo\"></p>\n<p><a href=\"https://en.wikipedia.org/wiki/Photometric_stereo\">Photometric stereo</a> is a technique in computer vision for estimating the surface normals of objects by observing that object under different lighting conditions. It is based on the fact that the amount of light reflected by a surface is dependent on the orientation of the surface in relation to the light source and the observer. By measuring the amount of light reflected into a camera, the space of possible surface orientations is limited. Given enough light sources from different angles, the surface orientation may be constrained to a single orientation or even over-constrained.</p>\n<h2>Methods</h2>\n<p></p>\n<p></p>\n<h2>Applications</h2>\n<h2>Software</h2>\n<p></p>\n<p>See the photometric stereo section on the <a href=\"Software\">Software</a> page.</p>\n<h2>Hardware</h2>\n<h3>Data Acquisition</h3>\n<h2>Resources</h2>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=os42t1Jb9IA\">Calibration Based Photometric Stereo | Photometric Stereo</a></li>\n</ul>\n<h2>See Also</h2>\n<p></p>\n<h2>References</h2>\n<p></p>\n"}